envelops/test/create.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:web="https://servicenow-test.dhl.com/cchm_change_request_create.do?SOAP"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ ">
    <soapenv:Header/>
    <soapenv:Body>
        <web:Create>
            <web:short_description>test new functions</web:short_description>
            <web:u_requested_by>nikita.matsnev@dhl.com</web:u_requested_by>
            <web:assigned_to>nikita.matsnev@dhl.com</web:assigned_to>
            <web:u_change_coordinator>ondrej.sztacho@dhl.com</web:u_change_coordinator>
            <web:priority>4</web:priority>
            <web:assignment_group>GROUP API Developer Portal</web:assignment_group>
            <web:category>Release</web:category>
            <web:start_date>2023-10-10 12:00:00</web:start_date>
            <web:end_date>2023-10-10 13:00:00</web:end_date>
            <web:u_application_name>devportal</web:u_application_name>
            <web:u_application_type>Internally Developed Application</web:u_application_type>
            <web:u_maintenance_window>Inside</web:u_maintenance_window>
            <web:reason>life_cycle_service_change</web:reason>
            <web:u_justification>We deploy new version of GAPI DevPortal</web:u_justification>
            <web:cmdb_ci>ITS DEVELOPER PORTAL</web:cmdb_ci>
            <web:u_impacted_environment>New Hardware</web:u_impacted_environment>
            <web:u_customer_rtp_date>2023-10-02 10:00:00</web:u_customer_rtp_date>
        </web:Create>
    </soapenv:Body>
</soapenv:Envelope>
